#!/bin/bash
#--------------------------------------------------------------------------------
# 処理概要
#   共通設定・定義
# 
# パラメーター
#   なし
#--------------------------------------------------------------------------------
set -u -o pipefail
export LC_ALL=C

#--------------------------------------------------------------------------------
# 設定
#--------------------------------------------------------------------------------
# プロジェクト名
readonly PROJ="twitter-api-study"
# バッチホーム
readonly BAT_HOME=$(cd $(dirname $0); pwd)
# ログ出力先ディレクトリ
readonly LOG_DIR="${BAT_HOME}/logs"
mkdir -p ${LOG_DIR}
# ログバックアップ保管先ディレクトリ
readonly LOG_BAK_DIR="${LOG_DIR}/bak"
mkdir -p ${LOG_BAK_DIR}
# ログ出力先
readonly LOG="${LOG_DIR}/${PROJ}.log"

#--------------------------------------------------------------------------------
# 関数
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# 処理概要
#   ログ出力
# 
# パラメーター
#   1: ログレベル
#   2: ログメッセージ
#
# 返却(標準出力・標準エラー出力)
#   yyyy-mm-dd HH:MM:SS.SSS {LEVEL} {PID} -- {MESSAGE}
#--------------------------------------------------------------------------------
log() {
  [ $# -eq 2 ] || exit 1

  date_time=`date "+%Y-%m-%d %H:%M:%S.%3N"`
  level=$1
  pid=$$
  message=$2

  echo "${date_time} ${level} ${pid} -- ${message}" |& tee -a ${LOG}
}
